Revit 2026 API

# CompoundStructureGetRegionIds Method

---

Gets the region ids of this compound structure.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IList<int> GetRegionIds()
```
```vb
Public Function GetRegionIds As IList(Of Integer)
```
```cpp
public:
IList<int>^ GetRegionIds()
```
```fsharp
member GetRegionIds : unit -> IList<int>
```

#### Return Value

IListInt32 The ids of the regions defining this CompoundStructure.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This operation is valid only for vertically compound structures. |

A vertically compound structure consists of regions with polygonal boundaries.

#### Reference

CompoundStructure Class

Autodesk.Revit.DB Namespace